app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "monroe"], ["last_name", "king"], ["created_at", "2020-01-13 19:28:09.064025"], ["updated_at", "2020-01-13 19:28:09.064025"]]
---
   def create

        student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "king II"], ["updated_at", "2020-01-13 19:38:57.814426"], ["id", 8]]
---
   def update


       s = Student.find(params[:id])
       s.update(strong_args(params[:student]))